## 简述
绑定技术，为了实现 c++ 的多态。
## 类的虚表

当一个类继承了另一个类时，对于虚函数会发生这个类继承了另一个类的函数调用权，即一个类继承了某个包含虚函数的基类，那么这个类将会生成虚表。

对于以下c++类定义
```c++
class A {
public:
    virtual void vfunc1();
    virtual void vfunc2();
    void func1();
    void func2();
private:
    int m_data1, m_data2;
};
```
下面是 A 类的内存布局
```powershell
class A size(12):
        +---
 0      | {vfptr}
 4      | m_data1
 8      | m_data2
        +---

A::$vftable@:
        | &A_meta
        |  0
 0      | &A::vfunc1
 1      | &A::vfunc2
```
由于存在虚表，因此 A 对象在内存中存在了一个虚表指针，这个虚表中保存了两个虚函数地址
对于非虚函数，并不存在于虚表中。
并且虚表的内容，是由编译器直接指定的。

## 指针
虚表是属于类的，即同一个类的虚表都是一样的
在编译期，每个类都被插入一个 `_vptr` 指针，指向了类的虚表地址

同样对于上述的 A 类，尝试获取 `vtable` 地址
```c++
A* a = new A;
void** vtable_a = *(void***)a;
printf("vtable_a address: %p\n", vtable_a);

A* b = new A;
void** vtable_b = *(void***)b;
printf("vtable_b address: %p\n", vtable_b);
```
输出
```powershell
vtable_a address: 0x00007FF7F003AF70
vtable_b address: 0x00007FF7F003AF70
```
```powershell
instance a:
        +---
 0      | [0x00007FF7F003AF70]
 4      | m_data1
 8      | m_data2
        +---
instance b:
        +---
 0      | [0x00007FF7F003AF70]
 4      | m_data1
 8      | m_data2
        +---
0x00007FF7F003AF70:
        +---
 0      | [0x00007FF6CE1D113B] // &A::vfunc1
 4      | [0x00007FF6CE1D1005] // &A::vfunc2
 8      | [0]
        +---
```

## 动态绑定
在继承关系中，编译器会为每个类插入虚表指针
当发生 `overrider` 时会将虚表上对应位置的虚函数地址改为该 `override` 的函数地址
子类继承时虚表中的虚函数地址按照继承关系中最近一个类的虚函数地址来指定

例如，对于以下类定义
```c++
class A {
public:
    virtual void vfunc1() {}
    virtual void vfunc2() {}
    void func1() {}
    void func2() {}
private:
    int m_data1, m_data2;
};
class B : public A {
public:
    virtual void vfunc1() {}
    void func1() {}
private:
    int m_data3;
};
class C: public B {
public:
    virtual void vfunc2() {}
    void func2() {}
private:
    int m_data1, m_data4;
};
```
分别打印虚表地址，虚函数地址
```c++
A* a = new A;
void** vtable_a = *(void***)a;
printf("vtable_a address: %p\n", vtable_a);
forech_v_func(vtable_a);

B* b = new B;
void** vtable_b = *(void***)b;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);

C* c = new C;
void** vtable_c = *(void***)c;
printf("vtable_c address: %p\n", vtable_c);
forech_v_func(vtable_c);
```
输出
```powershell
vtable_a address: 0x00007FF75F4BAEC0
v_0_func address: 0x00007FF75F4B1140 // &A::vfunc1
v_1_func address: 0x00007FF75F4B1005 // &A::vfunc2
vtable_b address: 0x00007FF75F4BAEE0
v_0_func address: 0x00007FF75F4B1221 // &B::vfunc1
v_1_func address: 0x00007FF75F4B1005 // &A::vfunc2
vtable_c address: 0x00007FF75F4BAF00
v_0_func address: 0x00007FF75F4B1221 // &B::vfunc1
v_1_func address: 0x00007FF75F4B132F // &C::vfunc2
```
![[1-1.jpg]]

可以看到，这三个类都分别具有一个虚表指针，指向三个不同的虚表

对于类 A, 虚表中有两个虚函数指针，分别指向 `&A::vfunc1`, `&A::vfunc2`.

对于类 B, 他继承于类 A，因此也继承了类A的虚函数调用，但是由于类B中重写了`vfunc1`,因此在他的虚表中，对应 `&A::vfunc1` 位置的指针被替换成了 `&B::vfunc1`

对于类 C，他继承于类 B, 因此也继承了类 B 的虚函数调用，并且也重写了 `vfunc2` 这个虚函数/
按照虚函数地址是继承关系中最近一个类的虚函数地址，类 C 中的虚函数就分别是 `B::vfunc1` 和 `C::vfunc2`

同时，对于类 C，如果对其进行 `upcast` 转为父类 B，并尝试调用父类的虚函数
```c++
C* c = new C;

B* c_to_b_ptr = (B*)c;
vtable_b = *(void***)c_to_b_ptr;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);
```
将会输出
```powershell
vtable_c address: 0x00007FF606ABAF00
v_0_func address: 0x00007FF606AB1221
v_1_func address: 0x00007FF606AB132F
vtable_b address: 0x00007FF606ABAF00
v_0_func address: 0x00007FF606AB1221
v_1_func address: 0x00007FF606AB132F
```
可以看到，即使使用了 `upcast`，`c_to_b_ptr` 应当指向该类中属于类 B 的部分，而虚表指针也属于基类的部分，因此可以访问到类 C 的虚表。
也可以得知，调用虚函数，本质也是通过虚表调用，即动态绑定，而不是传统函数的静态绑定。

对于非指针对象
```c++
C c;
vtable_c = *(void***)&c;
printf("vtable_c address: %p\n", vtable_c);
forech_v_func(vtable_c);  

B c_to_b = *dynamic_cast<B*>(&c);
vtable_b = *(void***)&c_to_b;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);
```
输出
```powershell
vtable_c address: 0x00007FF6506BAFB0
v_0_func address: 0x00007FF6506B1221
v_1_func address: 0x00007FF6506B1177
vtable_b address: 0x00007FF6506BAF90
v_0_func address: 0x00007FF6506B1221
v_1_func address: 0x00007FF6506B1005
```
可以看出，对于非指针类型，使用 `upcast` 后无法通过父类对象调用子类对象override的虚函数，

## 内存布局
### 非静态成员变量及成员函数的内存布局
#### 举例
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    void printf()
    {
        ::printf("id: %d, location: %d\n", id, location);
    }
private:
    int id;
    int location;
};

int main(){
    A p1;
    printf("sizeof(p1) = %ld\n", sizeof(p1));
    int* p = (int*)&p1;
    printf("id: %d, address: %x\n", *p, p);
    ++p;
    printf("location: %d, address: %x\n", *p, p);

    return 0;
}
``` 
### 结论
输出结果为：
sizeof(p1) = 8
id: 1, address: f43cf5a0
location: 2, address: f43cf5a4

说明该示例内存布局如下：  
class E size(8):  
        +---  
 0      | id  
 4      | location  
        +---  

如果该类中函数静态成员，对该类的大小和寻址都不会产生影响，说明静态成员不在类内部
非静态成员变量按照声明顺序保存在类内部  
静态成员变量则保存在类外部  

### 对于含有虚函数的类对象内存布局
#### 举例
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    virtual void printf()
    {
        ::printf("id: %d, location: %d\n", id, location);
    }
    virtual void say()
    {
        ::printf("hello\n");
    }
    virtual ~A()
    {
        ::printf("destruct A\n");
    }
private:
    int id;
    int location;
};

int main(){
    A p1;
    printf("sizeof(p1) = %d\n", sizeof(p1));
    int* p = (int*)&p1;
    for (int i = 0; i < sizeof(p1) / sizeof(int); ++i, ++p)
    {
        printf("p = %d\n", *p);
    }

    return 0;
}
```
#### 结论

输出结果为：
```powershell
sizeof(p1) = 16
p = -1101460160
p = 22036
p = 1
p = 2
destruct A
```

内存布局：
```powershell
class A size(16):
+---
0  | {vfptr}
8  | id
12 | location
+---

A::$vftable@:
| &A_meta
| 0
0 | &A::printf
1 | &A::say
2 | &A::{dtor}
```

虚函数是通过在类中插入虚函数表来实现的，在类中的每一个虚函数都会变成一个指针，由虚函数表持有这些指针
在没有虚基类的情况下，会在类头部插入该虚函数表的指针
可以通过虚函数表指针来访问实际的虚函数

在上面的例子中，一个指针大小为 8 位，因此前两个 int 合起来是一个虚函数表地址，后面是类成员变量
并且虚函数表中的虚函数会按照声明顺序插入

todo: 虚函数表中不止含有虚函数?

### 虚函数表内容以及虚函数存放位置
#### 举例
从上面的内存布局来看，类实例的内存地址首位保存了虚函数表地址  
因此可以通过指针获取虚函数表地址，然后获取到实际的虚函数指针  
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    virtual void printf()
    {
        ::printf("id: %d, location: %d\n", 1, 2);
    }
    virtual void say()
    {
        ::printf("hello\n");
    }
    virtual ~A()
    {
        ::printf("destruct A\n");
    }
private:
    int id;
    int location;
};

typedef void(*Fun)();

int main(){
    A p1;
    printf("sizeof(p1) = %d\n", sizeof(p1));

    const uint64_t class_ptr = (uint64_t)(char*)(&p1);
    uintptr_t* vtable = *(uintptr_t**)class_ptr;
    constexpr int v_count = 3;

    for (int i = 0; *(vtable) != NULL; ++i)
    {
        void* p = (void*)*(vtable);
        ++vtable;
        printf("Address = %x\n", p);
    }

    return 0;
}
```
#### 结论
输出结果为：
```powershell
sizeof(p1) = 16
Address = 5b211118
Address = 5b21140b
Address = 5b2111ef
```
该类含有三个虚函数，并且虚函数表以NULL作为结果标志

### 带有继承关系的类对象内存布局
1. 单继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A 
{
    SIMILAR_TO_F(A1)
};
```
内存布局：
```powershell
class A1        size(12):
        +---
 0      | +--- (base class A)
 0      | | {vfptr}
 4      | | v_A
        | +---
 8      | v_A1
        +---

A1::$vftable@:
        | &A1_meta
        |  0
 0      | &A::func_A_1
 1      | &A1::{dtor}
 2      | &A1::func_A1_1
```
虚表在类示例开头，并且虚表中包含父类虚函数和子类虚函数

2. 多重继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1
{
    SIMILAR_TO_F(A1)
};

class A2
{
    SIMILAR_TO_F(A2)
};

class D : public A1, public A2
{
    SIMILAR_TO_F(D)
};
```
内存布局：
```powershell
class D size(20):
        +---
 0      | +--- (base class A1)
 0      | | {vfptr}
 4      | | v_A1
        | +---
 8      | +--- (base class A2)
 8      | | {vfptr}
12      | | v_A2
        | +---
16      | v_D
        +---

D::$vftable@A1@:
        | &D_meta
        |  0
 0      | &A1::func_A1_1
 1      | &D::{dtor}
 2      | &D::func_D_1

D::$vftable@A2@:
        | -8
 0      | &A2::func_A2_1
 1      | &thunk: this-=8; goto D::{dtor}
```
相比于单继承，会多一个虚表，这个虚表属于第二个父类
第二个虚表不包含子类自己的虚函数
注意析构函数
如果D中使用了 override，那么将会替换对应位置的父类虚函数

3. 重复继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A
{
    SIMILAR_TO_F(A1)
};

class A2 : public A
{
    SIMILAR_TO_F(A2)
};

class D : public A1, public A2
{
    SIMILAR_TO_F(D)
};
```

内存布局：
```powershell
class D size(28):
        +---
 0      | +--- (base class A1)
 0      | | +--- (base class A)
 0      | | | {vfptr}
 4      | | | v_A
        | | +---
 8      | | v_A1
        | +---
12      | +--- (base class A2)
12      | | +--- (base class A)
12      | | | {vfptr}
16      | | | v_A
        | | +---
20      | | v_A2
        | +---
24      | v_D
        +---

D::$vftable@A1@:
        | &D_meta
        |  0
 0      | &A::func_A_1
 1      | &D::{dtor}
 2      | &A1::func_A1_1
 3      | &D::func_D_1

D::$vftable@A2@:
        | -12
 0      | &A::func_A_1
 1      | &thunk: this-=12; goto D::{dtor}
 2      | &A2::func_A2_1
```

可以看到，重复继承子类持有了多个同父类的变量
在虚表结构上与多继承保持一致，但会有多个同父类虚函数

4. 多重虚拟继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A
{
    SIMILAR_TO_F(A1)
};

class A2 : public A
{
    SIMILAR_TO_F(A2)
};

class E : virtual public A1, virtual public A2 
{
    SIMILAR_TO_F(E);
};
```

## 小工具
```powershell
# 打印 c++ 内存布局

cl.exe /d1reportSingleClassLayout<类名> <源文件名>
```