## 简述
绑定技术，为了实现 c++ 的多态。
## 类的虚表

当一个类继承了另一个类时，对于虚函数会发生这个类继承了另一个类的函数调用权，即一个类继承了某个包含虚函数的基类，那么这个类将会生成虚表。

对于以下c++类定义
```c++
class A {
public:
    virtual void vfunc1();
    virtual void vfunc2();
    void func1();
    void func2();
private:
    int m_data1, m_data2;
};
```
下面是 A 类的内存布局
```powershell
class A size(12):
        +---
 0      | {vfptr}
 4      | m_data1
 8      | m_data2
        +---

A::$vftable@:
        | &A_meta
        |  0
 0      | &A::vfunc1
 1      | &A::vfunc2
```
由于存在虚表，因此 A 对象在内存中存在了一个虚表指针，这个虚表中保存了两个虚函数地址
对于非虚函数，并不存在于虚表中。
并且虚表的内容，是由编译器直接指定的。

## 指针
虚表是属于类的，即同一个类的虚表都是一样的
在编译期，每个类都被插入一个 `_vptr` 指针，指向了类的虚表地址

同样对于上述的 A 类，尝试获取 `vtable` 地址
```c++
A* a = new A;
void** vtable_a = *(void***)a;
printf("vtable_a address: %p\n", vtable_a);

A* b = new A;
void** vtable_b = *(void***)b;
printf("vtable_b address: %p\n", vtable_b);
```
输出
```powershell
vtable_a address: 0x00007FF7F003AF70
vtable_b address: 0x00007FF7F003AF70
```
```powershell
instance a:
        +---
 0      | [0x00007FF7F003AF70]
 4      | m_data1
 8      | m_data2
        +---
instance b:
        +---
 0      | [0x00007FF7F003AF70]
 4      | m_data1
 8      | m_data2
        +---
0x00007FF7F003AF70:
        +---
 0      | [0x00007FF6CE1D113B] // &A::vfunc1
 4      | [0x00007FF6CE1D1005] // &A::vfunc2
 8      | [0]
        +---
```

## 动态绑定
在继承关系中，编译器会为每个类插入虚表指针
当发生 `overrider` 时会将虚表上对应位置的虚函数地址改为该 `override` 的函数地址
子类继承时虚表中的虚函数地址按照继承关系中最近一个类的虚函数地址来指定

例如，对于以下类定义
```c++
class A {
public:
    virtual void vfunc1() {}
    virtual void vfunc2() {}
    void func1() {}
    void func2() {}
private:
    int m_data1, m_data2;
};
class B : public A {
public:
    virtual void vfunc1() {}
    void func1() {}
private:
    int m_data3;
};
class C: public B {
public:
    virtual void vfunc2() {}
    void func2() {}
private:
    int m_data1, m_data4;
};
```
分别打印虚表地址，虚函数地址
```c++
A* a = new A;
void** vtable_a = *(void***)a;
printf("vtable_a address: %p\n", vtable_a);
forech_v_func(vtable_a);

B* b = new B;
void** vtable_b = *(void***)b;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);

C* c = new C;
void** vtable_c = *(void***)c;
printf("vtable_c address: %p\n", vtable_c);
forech_v_func(vtable_c);
```
输出
```powershell
vtable_a address: 0x00007FF75F4BAEC0
v_0_func address: 0x00007FF75F4B1140 // &A::vfunc1
v_1_func address: 0x00007FF75F4B1005 // &A::vfunc2
vtable_b address: 0x00007FF75F4BAEE0
v_0_func address: 0x00007FF75F4B1221 // &B::vfunc1
v_1_func address: 0x00007FF75F4B1005 // &A::vfunc2
vtable_c address: 0x00007FF75F4BAF00
v_0_func address: 0x00007FF75F4B1221 // &B::vfunc1
v_1_func address: 0x00007FF75F4B132F // &C::vfunc2
```
![[1-1.jpg]]

可以看到，这三个类都分别具有一个虚表指针，指向三个不同的虚表

对于类 A, 虚表中有两个虚函数指针，分别指向 `&A::vfunc1`, `&A::vfunc2`.

对于类 B, 他继承于类 A，因此也继承了类A的虚函数调用，但是由于类B中重写了`vfunc1`,因此在他的虚表中，对应 `&A::vfunc1` 位置的指针被替换成了 `&B::vfunc1`

对于类 C，他继承于类 B, 因此也继承了类 B 的虚函数调用，并且也重写了 `vfunc2` 这个虚函数/
按照虚函数地址是继承关系中最近一个类的虚函数地址，类 C 中的虚函数就分别是 `B::vfunc1` 和 `C::vfunc2`

同时，对于类 C，如果对其进行 `upcast` 转为父类 B，并尝试调用父类的虚函数
```c++
C* c = new C;

B* c_to_b_ptr = (B*)c;
vtable_b = *(void***)c_to_b_ptr;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);
```
将会输出
```powershell
vtable_c address: 0x00007FF606ABAF00
v_0_func address: 0x00007FF606AB1221
v_1_func address: 0x00007FF606AB132F
vtable_b address: 0x00007FF606ABAF00
v_0_func address: 0x00007FF606AB1221
v_1_func address: 0x00007FF606AB132F
```
可以看到，即使使用了 `upcast`，`c_to_b_ptr` 应当指向该类中属于类 B 的部分，而虚表指针也属于基类的部分，因此可以访问到类 C 的虚表。
也可以得知，调用虚函数，本质也是通过虚表调用，即动态绑定，而不是传统函数的静态绑定。

对于非指针对象
```c++
C c;
vtable_c = *(void***)&c;
printf("vtable_c address: %p\n", vtable_c);
forech_v_func(vtable_c);  

B c_to_b = *dynamic_cast<B*>(&c);
vtable_b = *(void***)&c_to_b;
printf("vtable_b address: %p\n", vtable_b);
forech_v_func(vtable_b);
```
输出
```powershell
vtable_c address: 0x00007FF6506BAFB0
v_0_func address: 0x00007FF6506B1221
v_1_func address: 0x00007FF6506B1177
vtable_b address: 0x00007FF6506BAF90
v_0_func address: 0x00007FF6506B1221
v_1_func address: 0x00007FF6506B1005
```
可以看出，对于非指针类型，使用 `upcast` 后无法通过父类对象调用子类对象override的虚函数.

## 虚继承
虚继承本质上来说是一种与虚函数完全无关的概念
他的出现是为了解决多重继承中可能出现的空间浪费和二义性问题

观察上面的图片，可以看到当子类继承父类时，父类的成员变量都会被复制到子类的内存布局中，造成子类的大小会随着继承链的增加而逐步增大。
同时，如果将基类指针指向继承类，那么可能会出现继承类中存在多个基类拷贝，从而导致二义性

虚继承的实现与各个编译器的实现有关，常见的实现是在继承类中安插虚基类指针和虚基类表
```c++
// 一个虚继承示例
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class E size(12):
        +---
 0      | {vbptr}
        +---
        +--- (virtual base A)
 4      | {vfptr}
 8      | v_A
        +---

E::$vbtable@:
 0      | 0
 1      | 4 (Ed(E+0)A)

E::$vftable@:
        | -4
 0      | &A::func_A_1
 1      | &E::{dtor}
```

与虚函数行为的相似之处
指针: 虚表指针和虚函数指针
虚表: 指针数组，保存虚基类成员和虚函数地址




## 内存布局
### 非静态成员变量及成员函数的内存布局
#### 举例
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    void printf()
    {
        ::printf("id: %d, location: %d\n", id, location);
    }
private:
    int id;
    int location;
};

int main(){
    A p1;
    printf("sizeof(p1) = %ld\n", sizeof(p1));
    int* p = (int*)&p1;
    printf("id: %d, address: %x\n", *p, p);
    ++p;
    printf("location: %d, address: %x\n", *p, p);

    return 0;
}
``` 
### 结论
输出结果为：
sizeof(p1) = 8
id: 1, address: f43cf5a0
location: 2, address: f43cf5a4

说明该示例内存布局如下：  
class E size(8):  
        +---  
 0      | id  
 4      | location  
        +---  

如果该类中函数静态成员，对该类的大小和寻址都不会产生影响，说明静态成员不在类内部
非静态成员变量按照声明顺序保存在类内部  
静态成员变量则保存在类外部  


### 对于含有虚函数的类对象内存布局
#### 举例
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    virtual void printf()
    {
        ::printf("id: %d, location: %d\n", id, location);
    }
    virtual void say()
    {
        ::printf("hello\n");
    }
    virtual ~A()
    {
        ::printf("destruct A\n");
    }
private:
    int id;
    int location;
};

int main(){
    A p1;
    printf("sizeof(p1) = %d\n", sizeof(p1));
    int* p = (int*)&p1;
    for (int i = 0; i < sizeof(p1) / sizeof(int); ++i, ++p)
    {
        printf("p = %d\n", *p);
    }

    return 0;
}
```
#### 结论

输出结果为：
```powershell
sizeof(p1) = 16
p = -1101460160
p = 22036
p = 1
p = 2
destruct A
```

内存布局：
```powershell
class A size(16):
+---
0  | {vfptr}
8  | id
12 | location
+---

A::$vftable@:
| &A_meta
| 0
0 | &A::printf
1 | &A::say
2 | &A::{dtor}
```

虚函数是通过在类中插入虚函数表来实现的，在类中的每一个虚函数都会变成一个指针，由虚函数表持有这些指针
在没有虚基类的情况下，会在类头部插入该虚函数表的指针
可以通过虚函数表指针来访问实际的虚函数

在上面的例子中，一个指针大小为 8 位，因此前两个 int 合起来是一个虚函数表地址，后面是类成员变量
并且虚函数表中的虚函数会按照声明顺序插入

todo: 虚函数表中不止含有虚函数?

### 虚函数表内容以及虚函数存放位置
#### 举例
从上面的内存布局来看，类实例的内存地址首位保存了虚函数表地址  
因此可以通过指针获取虚函数表地址，然后获取到实际的虚函数指针  
```c++
#include <iostream>

class A
{
public:
    A() : id(1), location(2) {}
    virtual void printf()
    {
        ::printf("id: %d, location: %d\n", 1, 2);
    }
    virtual void say()
    {
        ::printf("hello\n");
    }
    virtual ~A()
    {
        ::printf("destruct A\n");
    }
private:
    int id;
    int location;
};

typedef void(*Fun)();

int main(){
    A p1;
    printf("sizeof(p1) = %d\n", sizeof(p1));

    const uint64_t class_ptr = (uint64_t)(char*)(&p1);
    uintptr_t* vtable = *(uintptr_t**)class_ptr;
    constexpr int v_count = 3;

    for (int i = 0; *(vtable) != NULL; ++i)
    {
        void* p = (void*)*(vtable);
        ++vtable;
        printf("Address = %x\n", p);
    }

    return 0;
}
```
#### 结论
输出结果为：
```powershell
sizeof(p1) = 16
Address = 5b211118
Address = 5b21140b
Address = 5b2111ef
```
该类含有三个虚函数，并且虚函数表以NULL作为结果标志

### 带有继承关系的类对象内存布局
1. 单继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A 
{
    SIMILAR_TO_F(A1)
};
```
内存布局：
```powershell
class A1        size(12):
        +---
 0      | +--- (base class A)
 0      | | {vfptr}
 4      | | v_A
        | +---
 8      | v_A1
        +---

A1::$vftable@:
        | &A1_meta
        |  0
 0      | &A::func_A_1
 1      | &A1::{dtor}
 2      | &A1::func_A1_1
```
虚表在类示例开头，并且虚表中包含父类虚函数和子类虚函数

2. 多重继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1
{
    SIMILAR_TO_F(A1)
};

class A2
{
    SIMILAR_TO_F(A2)
};

class D : public A1, public A2
{
    SIMILAR_TO_F(D)
};
```
内存布局：
```powershell
class D size(20):
        +---
 0      | +--- (base class A1)
 0      | | {vfptr}
 4      | | v_A1
        | +---
 8      | +--- (base class A2)
 8      | | {vfptr}
12      | | v_A2
        | +---
16      | v_D
        +---

D::$vftable@A1@:
        | &D_meta
        |  0
 0      | &A1::func_A1_1
 1      | &D::{dtor}
 2      | &D::func_D_1

D::$vftable@A2@:
        | -8
 0      | &A2::func_A2_1
 1      | &thunk: this-=8; goto D::{dtor}
```
相比于单继承，会多一个虚表，这个虚表属于第二个父类
第二个虚表不包含子类自己的虚函数
注意析构函数
如果D中使用了 override，那么将会替换对应位置的父类虚函数

3. 重复继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A
{
    SIMILAR_TO_F(A1)
};

class A2 : public A
{
    SIMILAR_TO_F(A2)
};

class D : public A1, public A2
{
    SIMILAR_TO_F(D)
};
```

内存布局：
```powershell
class D size(28):
        +---
 0      | +--- (base class A1)
 0      | | +--- (base class A)
 0      | | | {vfptr}
 4      | | | v_A
        | | +---
 8      | | v_A1
        | +---
12      | +--- (base class A2)
12      | | +--- (base class A)
12      | | | {vfptr}
16      | | | v_A
        | | +---
20      | | v_A2
        | +---
24      | v_D
        +---

D::$vftable@A1@:
        | &D_meta
        |  0
 0      | &A::func_A_1
 1      | &D::{dtor}
 2      | &A1::func_A1_1
 3      | &D::func_D_1

D::$vftable@A2@:
        | -12
 0      | &A::func_A_1
 1      | &thunk: this-=12; goto D::{dtor}
 2      | &A2::func_A2_1
```

可以看到，重复继承子类持有了多个同父类的变量
在虚表结构上与多继承保持一致，但会有多个同父类虚函数

4. 多重虚拟继承
```c++
#define SIMILAR_TO_F(Class) \
public: \
    void func_##Class##_0(); \
    virtual void func_##Class##_1(); \
    static void func_##Class##_2(); \
    virtual ~##Class(); \
private: \
    int v_##Class; \
    static int g_##Class;

class A {
    SIMILAR_TO_F(A)
};

class A1 : public A
{
    SIMILAR_TO_F(A1)
};

class A2 : public A
{
    SIMILAR_TO_F(A2)
};

class E : virtual public A1, virtual public A2 
{
    SIMILAR_TO_F(E);
};
```

内存布局：
```c++
class E size(36):
        +---
 0      | {vfptr}
 4      | {vbptr}
 8      | v_E
        +---
        +--- (virtual base A1)
12      | +--- (base class A)
12      | | {vfptr}
16      | | v_A
        | +---
20      | v_A1
        +---
        +--- (virtual base A2)
24      | +--- (base class A)
24      | | {vfptr}
28      | | v_A
        | +---
32      | v_A2
        +---
```

```c++
class X {
public:
    virtual void print1() {
        cout << "X::print1 = " << (long)this << endl;
    }
    virtual void print2() {
        cout << "X::print2 = " << (long)this << endl;
    }
};

class Y {
public:
    virtual void print3() {
        cout << "Y::print3 = " << (long)this << endl;
    }
    virtual void print4() {
        cout << "Y::print4 = " << (long)this << endl;
    }
};

class Z : public X, public Y {
public:
    virtual void print2() {
        cout << "Z::print2 = " << (long)this << endl;
    }
    virtual void print4() {
        cout << "Z::print4 = " << (long)this << endl;
    }
};
int main() {
    Z z;
    Z* zp = &z;
    X* xp = zp;
    Y* yp = zp;
    cout << "zp = " << (long)zp << endl; // 148698312
    cout << "xp = " << (long)xp << endl; // 148698312
    cout << "yp = " << (long)yp << endl; // 148698320
    /*******************以派生类指针调用基类虚函数*******************/
    zp->print1();
    zp->print3();
    /*******************以派生里指针调用派生类虚函数**************/
    zp->print2();
    zp->print4();
    /*******************以基类指针调用基类虚函数***************/
    xp->print1();
    yp->print3();
    /***********************以基类指针调用派生类虚函数***********/
    xp->print2();
    yp->print4();
}
```
```powershell
    /*******************以派生类指针调用基类虚函数*******************/
    zp->print1();
00007FF7EA462921  mov         rax,qword ptr [zp]  // 获取zp对象首地址
00007FF7EA462925  mov         rax,qword ptr [rax]  // 获取zp对象首地址的内容,是vftable
00007FF7EA462928  mov         rcx,qword ptr [zp]  // 将zp对象作为隐含参数传递
00007FF7EA46292C  call        qword ptr [rax]  // 调用vftable首地址的内容，是print1()
    zp->print3();
00007FF7EA46292E  mov         rax,qword ptr [zp]  // 获取zp对象首地址
00007FF7EA462932  add         rax,8 // 地址额外加 8, 得到 Y 的地址
00007FF7EA462936  mov         rcx,qword ptr [zp]  // 将zp对象的首地址给rcx寄存器
00007FF7EA46293A  mov         rcx,qword ptr [rcx+8]  // zp偏移8bytes的内容给rcx，vftable
00007FF7EA46293E  mov         qword ptr [rbp+148h],rcx
00007FF7EA462945  mov         rcx,rax
00007FF7EA462948  mov         rax,qword ptr [rbp+148h]  
00007FF7EA46294F  call        qword ptr [rax]  // 调用 vftable 首地址内容，print3()
    /*******************以派生里指针调用派生类虚函数**************/
    zp->print2();
00007FF7EA462951  mov         rax,qword ptr [zp]  
00007FF7EA462955  mov         rax,qword ptr [rax]  
00007FF7EA462958  mov         rcx,qword ptr [zp]  
00007FF7EA46295C  call        qword ptr [rax+8]  // 调用偏移vftable首地址8bytes的内容
    zp->print4();
00007FF7EA46295F  mov         rax,qword ptr [zp]  
00007FF7EA462963  add         rax,8  // 地址额外加 8, 得到 Y 的地址
00007FF7EA462967  mov         rcx,qword ptr [zp]  
00007FF7EA46296B  mov         rcx,qword ptr [rcx+8]  // zp偏移8bytes的内容给rcx，vftable
00007FF7EA46296F  mov         qword ptr [rbp+148h],rcx  
00007FF7EA462976  mov         rcx,rax  
00007FF7EA462979  mov         rax,qword ptr [rbp+148h]  
00007FF7EA462980  call        qword ptr [rax+8]  // 调用偏移vftable首地址8bytes的内容
    /*******************以基类指针调用基类虚函数***************/
    xp->print1();
00007FF7EA462983  mov         rax,qword ptr [xp]  // 将父类x的地址给 rax
00007FF7EA462987  mov         rax,qword ptr [rax]  // 获取x的地址内容，vftable
00007FF7EA46298A  mov         rcx,qword ptr [xp]  // 将父类x地址给rcx,隐含参数
00007FF7EA46298E  call        qword ptr [rax]  // 调用 vftable首地址内容，print1()
    yp->print3();
00007FF7EA462990  mov         rax,qword ptr [yp]  // 将父类y的地址给 rax
00007FF7EA462994  mov         rax,qword ptr [rax]   // 获取y的地址内容，vftable
00007FF7EA462997  mov         rcx,qword ptr [yp]   // 将父类y地址给rcx,隐含参数
00007FF7EA46299B  call        qword ptr [rax]   // 调用 vftable首地址内容，print3()
    /***********************以基类指针调用派生类虚函数***********/
    xp->print2();
00007FF7EA46299D  mov         rax,qword ptr [xp]  // 将父类x的地址给 rax
00007FF7EA4629A1  mov         rax,qword ptr [rax]  // 获取x的地址内容，vftable
00007FF7EA4629A4  mov         rcx,qword ptr [xp]  // 将父类x地址给rcx,隐含参数
00007FF7EA4629A8  call        qword ptr [rax+8]  // 调用偏移vftable首地址8bytes内容，print2()
    yp->print4();
00007FF7EA4629AB  mov         rax,qword ptr [yp]  // 将父类y的地址给 rax
00007FF7EA4629AF  mov         rax,qword ptr [rax]  // 获取y的地址内容，vftable
00007FF7EA4629B2  mov         rcx,qword ptr [yp]   // 将父类y地址给rcx,隐含参数
00007FF7EA4629B6  call        qword ptr [rax+8]// 调用偏移vftable首地址8byte，print4()
```
```powershell
    virtual void print4() {
00007FF7EA462770  mov         qword ptr [rsp+8],rcx  // 获取 rcx 的内容
00007FF7EA462775  push        rbp  
00007FF7EA462776  push        rdi  
00007FF7EA462777  sub         rsp,0F8h // 分配 0F8h 空间  
00007FF7EA46277E  lea         rbp,[rsp+20h]  // 计算相对于栈顶的偏移量
00007FF7EA462783  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF7EA475068h)]  
00007FF7EA46278A  call        __CheckForDebuggerJustMyCode (07FF7EA46143Dh)  
        cout << "Z::print4 = " << (long)this << endl;
00007FF7EA46278F  mov         rax,qword ptr [this]  // 这里是父类 Y 的首地址
00007FF7EA462796  sub         rax,8  // 减去8 bytes，得到 Z 的首地址
00007FF7EA46279A  mov         qword ptr [rbp+0C0h],rax   // 作为参数
00007FF7EA4627A1  lea         rdx,[string "Z::print4 = " (07FF7EA46BD78h)]  
00007FF7EA4627A8  mov         rcx,qword ptr [__imp_std::cout (07FF7EA473190h)]  
00007FF7EA4627AF  call        std::operator<<<std::char_traits<char> > (07FF7EA461091h)  
00007FF7EA4627B4  mov         rcx,qword ptr [rbp+0C0h]  
00007FF7EA4627BB  mov         edx,ecx  
00007FF7EA4627BD  mov         rcx,rax  
00007FF7EA4627C0  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF7EA473168h)]  
00007FF7EA4627C6  lea         rdx,[std::endl<char,std::char_traits<char> > (07FF7EA46103Ch)]  
00007FF7EA4627CD  mov         rcx,rax  
00007FF7EA4627D0  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF7EA473170h)]  
    }
    virtual void print1() {
00007FF7EA4624F0  mov         qword ptr [rsp+8],rcx  
00007FF7EA4624F5  push        rbp  
00007FF7EA4624F6  push        rdi  
00007FF7EA4624F7  sub         rsp,0E8h  
00007FF7EA4624FE  lea         rbp,[rsp+20h]  
00007FF7EA462503  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF7EA475068h)]  
00007FF7EA46250A  call        __CheckForDebuggerJustMyCode (07FF7EA46143Dh)  
        cout << "X::print1 = " << (long)this << endl;
00007FF7EA46250F  lea         rdx,[string "X::print1 = " (07FF7EA46BCC8h)]  
00007FF7EA462516  mov         rcx,qword ptr [__imp_std::cout (07FF7EA473190h)]  
00007FF7EA46251D  call        std::operator<<<std::char_traits<char> > (07FF7EA461091h)  
00007FF7EA462522  mov         edx,dword ptr [this]  
00007FF7EA462528  mov         rcx,rax  
00007FF7EA46252B  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF7EA473168h)]  
00007FF7EA462531  lea         rdx,[std::endl<char,std::char_traits<char> > (07FF7EA46103Ch)]  
00007FF7EA462538  mov         rcx,rax  
00007FF7EA46253B  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF7EA473170h)]  
    }
    virtual void print2() {
00007FF6082825F0  mov         qword ptr [rsp+8],rcx  
00007FF6082825F5  push        rbp  
00007FF6082825F6  push        rdi  
00007FF6082825F7  sub         rsp,0E8h  
00007FF6082825FE  lea         rbp,[rsp+20h]  
00007FF608282603  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF608295068h)]  
00007FF60828260A  call        __CheckForDebuggerJustMyCode (07FF60828143Dh)  
        cout << "Z::print2 = " << (long)this << endl;
00007FF60828260F  lea         rdx,[string "Z::print2 = " (07FF60828BD68h)]  
00007FF608282616  mov         rcx,qword ptr [__imp_std::cout (07FF608293190h)]  
00007FF60828261D  call        std::operator<<<std::char_traits<char> > (07FF608281091h)  
00007FF608282622  mov         edx,dword ptr [this]  
00007FF608282628  mov         rcx,rax  
00007FF60828262B  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF608293168h)]  
00007FF608282631  lea         rdx,[std::endl<char,std::char_traits<char> > (07FF60828103Ch)]  
00007FF608282638  mov         rcx,rax  
00007FF60828263B  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF608293170h)]  
    }
    virtual void print3() {
00007FF785582670  mov         qword ptr [rsp+8],rcx  
00007FF785582675  push        rbp  
00007FF785582676  push        rdi  
00007FF785582677  sub         rsp,0E8h  
00007FF78558267E  lea         rbp,[rsp+20h]  
00007FF785582683  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF785595068h)]  
00007FF78558268A  call        __CheckForDebuggerJustMyCode (07FF78558143Dh)  
        cout << "Y::print3 = " << (long)this << endl;
00007FF78558268F  lea         rdx,[string "Y::print3 = " (07FF78558BD08h)]  
00007FF785582696  mov         rcx,qword ptr [__imp_std::cout (07FF785593190h)]  
00007FF78558269D  call        std::operator<<<std::char_traits<char> > (07FF785581091h)  
00007FF7855826A2  mov         edx,dword ptr [this]  
00007FF7855826A8  mov         rcx,rax  
00007FF7855826AB  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF785593168h)]  
00007FF7855826B1  lea         rdx,[std::endl<char,std::char_traits<char> > (07FF78558103Ch)]  
00007FF7855826B8  mov         rcx,rax  
00007FF7855826BB  call        qword ptr [__imp_std::basic_ostream<char,std::char_traits<char> >::operator<< (07FF785593170h)]
    }

; [thunk]: X::`vcall'{0,{flat}}
??_9X@@$BA@AA proc near
mov     rax, [rcx] // rcx 中保存的是对象x的首地址，vftable
jmp     qword ptr [rax] // 获取vftable首地址的内容，vcall'0
??_9X@@$BA@AA endp

; [thunk]: X::`vcall'{8,{flat}}
??_9X@@$B7AA proc near
mov     rax, [rcx] // rcx 中保存的是对象x的首地址，vftable
jmp     qword ptr [rax+8] // 获取vftable首地址的内容，vcall'8
??_9X@@$B7AA endp


mov     [rsp+1E0h+ii], 4 ; ii
mov     r9d, 3          ; kk
mov     r8d, 2          ; jj
mov     edx, 1          ; ll  // 入栈
lea     rcx, [rbp+1B0h+var_1A8] ; this // 第一个隐含参数是 this, 也就是 b 的首地址
call    j_??0Bottom@@QEAA@HHHH@Z ; Bottom::Bottom(int,int,int,int) // 调用构造函数


    Left* lp = bp;
00007FF72CAD1B11  mov         rax,qword ptr [bp]  // 父类Left地址，父类left首地址和b一样
00007FF72CAD1B15  mov         qword ptr [lp],rax  // 这里就是将bp地址给lp
    b.j = 1;
00007FF72CAD1B19  mov         dword ptr [rbp+10h],1  
    bp->j = 2;
00007FF72CAD1B20  mov         rax,qword ptr [bp]  
00007FF72CAD1B24  mov         dword ptr [rax+8],2  
    lp->j = 3;
00007FF72CAD1B2B  mov         rax,qword ptr [lp]  
00007FF72CAD1B2F  mov         dword ptr [rax+8],3


    Right* rp = bp;
00007FF72CAD1B36  cmp         qword ptr [bp],0  // 判断 bp指针是否为空
00007FF72CAD1B3B  je          __$EncStackInitStart+0AFh (07FF72CAD1B4Eh)  
00007FF72CAD1B3D  mov         rax,qword ptr [bp]  // 将对象b的首地址给 rax
00007FF72CAD1B41  add         rax,10h  // 偏移 10h
00007FF72CAD1B45  mov         qword ptr [rbp+188h],rax  // 得到Right对象首地址
00007FF72CAD1B4C  jmp         __$EncStackInitStart+0BAh (07FF72CAD1B59h)  // 跳转执行
00007FF72CAD1B4E  mov         qword ptr [rbp+188h],0  // bp为空时执行
00007FF72CAD1B59  mov         rax,qword ptr [rbp+188h]  
00007FF72CAD1B60  mov         qword ptr [rp],rax  // 将Right对象首地址写入到rp内存中


    Top* tp = bp;
00007FF72CAD1B87  cmp         qword ptr [bp],0  
00007FF72CAD1B8C  jne         __$EncStackInitStart+0FCh (07FF72CAD1B9Bh)
// --> 07FF72CAD1B9Bh
00007FF72CAD1B8E  mov         qword ptr [rbp+188h],0  
00007FF72CAD1B99  jmp         __$EncStackInitStart+118h (07FF72CAD1BB7h)  
00007FF72CAD1B9B  mov         rax,qword ptr [bp]  // <-- 获取b对象首地址
00007FF72CAD1B9F  mov         rax,qword ptr [rax]  // 将地址内容给rax，这里是vbtable
00007FF72CAD1BA2  movsxd      rax,dword ptr [rax+4]
// 这里取vbtable首地址偏移4bytes处的内存内容到rax
00007FF72CAD1BA6  mov         rcx,qword ptr [bp]  
00007FF72CAD1BAA  add         rcx,rax  // 将首地址加上偏移，就得到Top的地址
00007FF72CAD1BAD  mov         rax,rcx  
00007FF72CAD1BB0  mov         qword ptr [rbp+188h],rax  
00007FF72CAD1BB7  mov         rax,qword ptr [rbp+188h]  
00007FF72CAD1BBE  mov         qword ptr [tp],rax  // 完成了赋值


    Bottom(int ll, int jj, int kk, int ii) : Top(ii), Left(jj, ii), Right(kk, ii) {
00007FF72CAD17B0  mov         dword ptr [rsp+20h],r9d  
00007FF72CAD17B5  mov         dword ptr [rsp+18h],r8d  
00007FF72CAD17BA  mov         dword ptr [rsp+10h],edx  
00007FF72CAD17BE  mov         qword ptr [rsp+8],rcx  
00007FF72CAD17C3  push        rbp  
00007FF72CAD17C4  push        rdi  
00007FF72CAD17C5  sub         rsp,0E8h  
00007FF72CAD17CC  lea         rbp,[rsp+20h]  
00007FF72CAD17D1  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF72CAE2000h)]  
00007FF72CAD17D8  call        __CheckForDebuggerJustMyCode (07FF72CAD136Bh)  
00007FF72CAD17DD  cmp         dword ptr [rbp+108h],0
//这里代表的是构造器标志，其值为1 
00007FF72CAD17E4  je          Bottom::Bottom+72h (07FF72CAD1822h)
//相等就跳到07FF72CAD1822h，这里不跳  
00007FF72CAD17E6  mov         rax,qword ptr [this]//将b对象首地址给rax  
00007FF72CAD17ED  lea         rcx,[Bottom::`vbtable' (07FF72CADAC48h)]将vbtable写入 
00007FF72CAD17F4  mov         qword ptr [rax],rcx  
00007FF72CAD17F7  mov         rax,qword ptr [this]//将b对象首地址给rax  
00007FF72CAD17FE  lea         rcx,[Bottom::`vbtable' (07FF72CADAC58h)]将vbtable写入  
00007FF72CAD1805  mov         qword ptr [rax+10h],rcx  
00007FF72CAD1809  mov         rax,qword ptr [this]  
00007FF72CAD1810  add         rax,28h  
00007FF72CAD1814  mov         edx,dword ptr [ii]  
00007FF72CAD181A  mov         rcx,rax  
00007FF72CAD181D  call        Top::Top (07FF72CAD138Eh)  
00007FF72CAD1822  xor         r9d,r9d  // 设置标志位为0，表示以下都不要构造基类
00007FF72CAD1825  mov         r8d,dword ptr [ii]  
00007FF72CAD182C  mov         edx,dword ptr [jj]  
00007FF72CAD1832  mov         rcx,qword ptr [this]  
00007FF72CAD1839  call        Left::Left (07FF72CAD1348h)  
00007FF72CAD183E  mov         rax,qword ptr [this]  
00007FF72CAD1845  add         rax,10h  
00007FF72CAD1849  xor         r9d,r9d  // 设置标志位为0，表示以下都不要构造基类
00007FF72CAD184C  mov         r8d,dword ptr [ii]  
00007FF72CAD1853  mov         edx,dword ptr [kk]  
00007FF72CAD1859  mov         rcx,rax  
00007FF72CAD185C  call        Right::Right (07FF72CAD11D6h)  
        l = ll;
00007FF72CAD1861  mov         rax,qword ptr [this]  
00007FF72CAD1868  mov         ecx,dword ptr [ll]  
00007FF72CAD186E  mov         dword ptr [rax+20h],ecx  
    }


    Left(int jj, int ii) : Top(ii) {
00007FF72CAD18C0  mov         dword ptr [rsp+20h],r9d  
00007FF72CAD18C5  mov         dword ptr [rsp+18h],r8d  
00007FF72CAD18CA  mov         dword ptr [rsp+10h],edx  
00007FF72CAD18CE  mov         qword ptr [rsp+8],rcx  
00007FF72CAD18D3  push        rbp  
00007FF72CAD18D4  push        rdi  
00007FF72CAD18D5  sub         rsp,0E8h  
00007FF72CAD18DC  lea         rbp,[rsp+20h]  
00007FF72CAD18E1  lea         rcx,[__31297469_ConsoleApplication4@cpp (07FF72CAE2000h)]  
00007FF72CAD18E8  call        __CheckForDebuggerJustMyCode (07FF72CAD136Bh)  
00007FF72CAD18ED  cmp         dword ptr [rbp+0F8h],0  
00007FF72CAD18F4  je          Left::Left+60h (07FF72CAD1920h)  
// 相等跳00007FF72CAD1920
// 也就是不会调用其基类构造
00007FF72CAD18F6  mov         rax,qword ptr [this]  
00007FF72CAD18FD  lea         rcx,[Left::`vbtable' (07FF72CADAC28h)]  // 调用基类构造
00007FF72CAD1904  mov         qword ptr [rax],rcx  
00007FF72CAD1907  mov         rax,qword ptr [this]  
00007FF72CAD190E  add         rax,10h  
00007FF72CAD1912  mov         edx,dword ptr [ii]  
00007FF72CAD1918  mov         rcx,rax  
00007FF72CAD191B  call        Top::Top (07FF72CAD138Eh)  
        j = jj;
00007FF72CAD1920  mov         rax,qword ptr [this]  
00007FF72CAD1927  mov         ecx,dword ptr [jj]  
00007FF72CAD192D  mov         dword ptr [rax+8],ecx  
    }

    int ltop = lp->getTop();
00007FF66F2D2183  mov         rax,qword ptr [lp]  // 获取lp的首地址
00007FF66F2D218A  mov         rax,qword ptr [rax+8]  // lp首地址加8偏移得到vbtable
00007FF66F2D218E  movsxd      rax,dword ptr [rax+4]  
// vbtable加4偏移得到基类Top相对于Left对象的vbtable偏移
00007FF66F2D2192  mov         rcx,qword ptr [lp]  
00007FF66F2D2199  mov         rcx,qword ptr [rcx+8]  
00007FF66F2D219D  movsxd      rcx,dword ptr [rcx+4]  
00007FF66F2D21A1  mov         rdx,qword ptr [lp]  
00007FF66F2D21A8  lea         rcx,[rdx+rcx+8] 
00007FF66F2D21AD  mov         rdx,qword ptr [lp]  
00007FF66F2D21B4  mov         rax,qword ptr [rdx+rax+8]  
// rdx为lp首地址，这里也是left父类的首地址，加上
// rcx存放left的vbtable到Top基类的vbtable指针的偏移值，加上
// 父类left自身的vptr指针大小
// 就得到虚基类Top对象处的内容
00007FF66F2D21B9  call        qword ptr [rax]  
00007FF66F2D21BB  mov         dword ptr [ltop],eax  

```


## 小工具
```powershell
# 打印 c++ 内存布局

cl.exe /d1reportSingleClassLayout<类名> <源文件名>
```